In [6]:
import pandas as pd

exam_data = {
    '이름': ['서준', '우현', '인아'],
    '수학': [90, 80, 70],
    '영어': [98, 89, 95],
    '음악': [85, 95, 100],
    '체육': [100, 90, 90]
}

df = pd.DataFrame(exam_data)

# 인덱스를 숫자로 다시 설정
df.index = pd.Index([1, 2, 3])
print(df)

   이름  수학  영어   음악   체육
1  서준  90  98   85  100
2  우현  80  89   95   90
3  인아  70  95  100   90

In [12]:
#행 인덱스 재배열 reindex()
#예제 1-17

import pandas as pd

# ✅ 딕셔너리는 중괄호 {}로
dict_data = {'c0': [1, 2, 3],'c1': [4, 5, 6],'c2': [7, 8, 9],'c3': [10, 11, 12],'c4': [13, 14, 15]}

# ✅ DataFrame 생성
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [14]:
#문제 1
import pandas as pd

exam_data = {
    '이름': ['철수', '영희', '민수'],
    '국어': [90, 70, 85],
    '영어': [85, 95, 80],
    '수학': [80, 100, 90],
}

df = pd.DataFrame(exam_data)

print(df)

   이름  국어  영어   수학
0  철수  90  85   80
1  영희  70  95  100
2  민수  85  80   90

In [15]:
#문제 2
# 상품 주문 데이터 구성

order_data = {
    '주문번호': [1001, 1002, 1003],
    '상품명': ['키보드', '모니터', '마우스'],
    '수량': [2, 1, 3],
    '단가': [30000, 150000, 20000]
}

df = pd.DataFrame(order_data)

print(df)

   주문번호  상품명  수량      단가
0  1001  키보드   2   30000
1  1002  모니터   1  150000
2  1003  마우스   3   20000

In [18]:
#문제 3
#아래 데이터를 가지고 DataFrame을 만들고,
#행 인덱스를 '학생명' 으로, 열 이름을 한글로 변경 하세요.
#열 이름을 ["나이", "반"] 으로 변경하세요.

exam_data = {
    "Name": ["철수", "영희", "민수"],
    "Age": [16, 17, 16],
    "Class": ["A", "B", "A"]
}

df = pd.DataFrame(exam_data)

print(df)

  Name  Age Class
0   철수   16     A
1   영희   17     B
2   민수   16     A

In [25]:
#고객 주문 데이터에서 행과 열 삭제하기
#아래 데이터를 pandas DataFrame으로 만들고,
#특정 행과 열을 삭제해보세요.

import pandas as pd

data = {
    '주문번호': [1001, 1002, 1003],
    '고객명': ['김철수', '이영희', '박민수'],
    '상품명': ['키보드', '모니터', '마우스'],
    '수량': [2, 1, 3],
    '가격': [30000, 150000, 20000]
}

# DataFrame 생성
df = pd.DataFrame(data)
df.set_index('주문번호', inplace=True)
df = df.drop(index=1002)
df = df.drop(columns='가격')

print(df)

      고객명  상품명  수량
주문번호
1001  김철수  키보드   2
1003  박민수  마우스   3

In [26]:
#문제1
student_data = { '이름':['철수','영희','민수'], '국어':[90,70,85], '영어':[85,95,80], '수학':[80,100,90] }
df = pd.DataFrame( student_data )
df

   이름  국어  영어   수학
0  철수  90  85   80
1  영희  70  95  100
2  민수  85  80   90

In [27]:
#문제2
product_order_data = { '주문번호':[1001, 1002, 1003], '상품명':['키보드', '모니터','마우스'], '수량':[2,1,3], '단가':[30000,150000,20000] }
df = pd.DataFrame( product_order_data )
df

   주문번호  상품명  수량      단가
0  1001  키보드   2   30000
1  1002  모니터   1  150000
2  1003  마우스   3   20000

In [32]:
# 문제3) 행인덱스/열이름 설정하기 
# 학생 출석부 데이터
# 요구사항 
# 아래 데이터를 가지고 DataFrame을 만들고,
# 행 인덱스를 '학생명' 으로, 열 이름을 한글로 변경 하세요.
# 열 이름을 ["나이", "반"] 으로 변경하세요.

data3 = {"Name": ["철수", "영희", "민수"],
        "Age": [16, 17, 16],
        "Class": ["A", "B", "A"]
       }

df3 = pd.DataFrame(data3)
# 변수 = 데이터프레임.rename(columns = { 기존 이름 : 변경후 이름 , ...})
df3 = df3.rename(columns = {'Name':'학생명', 'Age':'나이','Class':'반'})
# 변수 = 데이터프레임.rename(index = { 기존 이름 : 변경후 이름 , ...})
df3_1 = df3.set_index(['학생명'])

df3_1

     나이  반
학생명
철수   16  A
영희   17  B
민수   16  A

In [29]:
# 문제4) 행/열삭제
# 고객 주문 데이터에서 행과 열 삭제하기
# 아래 데이터를 pandas DataFrame으로 만들고,
# 특정 행과 열을 삭제해보세요.

custom_data = { '주문번호':[1001, 1002, 1003], 
               '고객명':['김철수', '이영희', '박민수'], 
               '상품명': [ '키보드','모니터','마우스'], 
               '수량':[2,1,3], 
               '가격': [30000,150000, 20000] }

df = pd.DataFrame( custom_data )
drop_index = df [ df[ '주문번호' ] == 1002 ].index
drop_index
drop_df=df.drop( drop_index, axis=0)
drop_df
drop_가격 = df.drop( '가격', axis=1 )
drop_가격

   주문번호  고객명  상품명  수량
0  1001  김철수  키보드   2
1  1002  이영희  모니터   1
2  1003  박민수  마우스   3

In [33]:
#다른사람 출력예시
import pandas as pd
data = {'주문번호': ['1001', '1002', '1003'],
        '고객명': ['김철수', '이영희', '박민수'],
        '상품명': ['키보드', '모니터', '마우스'],
        '수량': [2, 1, 3],
        '가격': [3000, 150000, 20000]}
df = pd.DataFrame(data)
df2 = df.drop([1])
df3 = df2.drop('가격', axis=1)
df3

   주문번호  고객명  상품명  수량
0  1001  김철수  키보드   2
2  1003  박민수  마우스   3

In [30]:
# 문제5) 행/열 선택
#  쇼핑몰 주문 데이터
# 다음 데이터를 DataFrame으로 만들고,
# 행과 열을 선택해보세요!

shop_data = {
    "주문번호": [1001, 1002, 1003],
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3],
    "가격": [30000, 150000, 20000]
}
df = pd.DataFrame( shop_data )
df
df=df.set_index('주문번호')
df.loc[1002] # 주문번호 1002의 상품명만 선택해서 출력

# 수량과 가격 열만 선택해서 모든 행 출력
df[ ['수량','가격'] ]

# 1~2번째 행과 '고객명', '상품명' 열만 선택해서 출력
df.iloc[ [1,2], [1,2] ]

      상품명  수량
주문번호
1002  모니터   1
1003  마우스   3

In [31]:
# 문제6)  원소값 수정하기 
# 학생 성적 데이터 수정하기
# 다음 데이터를 DataFrame으로 만들고,
# 특정 원소 값을 수정하세요!

data = {
    '주문번호': [1001, 1002, 1003],
    '고객명': ['김철수', '이영희', '박민수'],
    '상품명': ['키보드', '모니터', '마우스'],
    '수량': [2, 1, 3],
    '가격': [30000, 150000, 20000]
}

# DataFrame 생성
df = pd.DataFrame(data)

# 인덱스 설정
df = df.set_index('주문번호')

# 행 삭제 (1002)
df = df.drop(index=1002)

# 열 삭제 ('가격')
df = df.drop(columns='가격')

# 출력
print(df)

      고객명  상품명  수량
주문번호
1001  김철수  키보드   2
1003  박민수  마우스   3

In [4]:
# 문제7
import pandas as pd
custom_order_data = {
    "주문번호": [1001, 1002, 1003],
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3],
    "가격": [30000, 150000, 20000]
}

df = pd.DataFrame( custom_order_data )
# 주문번호를 인덱스로 설정
df = df.set_index( '주문번호' )
df
# 주문번호 1002에 해당하는 고객명과 상품명을 출력
df.loc[1002, ['고객명','상품명'] ]

고객명    이영희
상품명    모니터
Name: 1002, dtype: object

In [6]:
product_order_data = { '주문번호':[1001, 1002, 1003], '상품명':['키보드', '모니터','마우스'], '수량':[2,1,3], '단가':[30000,150000,20000] }
df = pd.DataFrame( product_order_data )
df

   주문번호  상품명  수량      단가
0  1001  키보드   2   30000
1  1002  모니터   1  150000
2  1003  마우스   3   20000

In [8]:
#문제3
data = {
    "Name": ["철수", "영희", "민수"],
    "Age": [16, 17, 16],
    "Class": ["A", "B", "A"]
}
df = pd.DataFrame( data )
df_1 =df.set_index( 'Name' )
df_1.columns = ['나이','반' ]
df_1

      나이  반
Name
철수    16  A
영희    17  B
민수    16  A

In [10]:
# 문제4) 
custom_data = { '주문번호':[1001, 1002, 1003], '고객명':['김철수', '이영희', '박민수'], '상품명': [ '키보드','모니터','마우스'], '수량':[2,1,3], '가격': [30000,150000, 20000] }
df = pd.DataFrame( custom_data )
drop_index = df [ df[ '주문번호' ] == 1002 ].index
drop_index
drop_df=df.drop( drop_index, axis=0)
drop_df
drop_가격 = df.drop( '가격', axis=1 )
drop_가격

   주문번호  고객명  상품명  수량
0  1001  김철수  키보드   2
1  1002  이영희  모니터   1
2  1003  박민수  마우스   3

In [12]:
#문제5 
shop_data = {
    "주문번호": [1001, 1002, 1003],
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3],
    "가격": [30000, 150000, 20000]
}
df = pd.DataFrame( shop_data )
df
df=df.set_index('주문번호')
df.loc[1002] # 주문번호 1002의 상품명만 선택해서 출력

# 수량과 가격 열만 선택해서 모든 행 출력
df[ ['수량','가격'] ]

# 1~2번째 행과 '고객명', '상품명' 열만 선택해서 출력
df.iloc[ [1,2], [1,2] ]

      상품명  수량
주문번호
1002  모니터   1
1003  마우스   3

In [16]:
# 문제6
jumsu_data = {
    "이름": ["철수", "영희", "민수"],
    "국어": [90, 70, 85],
    "영어": [85, 95, 80],
    "수학": [80, 100, 90]
}
df = pd.DataFrame( jumsu_data )
df
df=df.set_index( '이름' )
df
df.loc[ '영희', '수학' ] = 98
df.loc['민수','영어'] = 82
df

    국어  영어  수학
이름
철수  90  85  80
영희  70  95  98
민수  85  82  90

In [14]:
# 문제7
custom_order_data = {
    "주문번호": [1001, 1002, 1003],
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3],
    "가격": [30000, 150000, 20000]
}

df = pd.DataFrame( custom_order_data )
# 주문번호를 인덱스로 설정
df = df.set_index( '주문번호' )
df
# 주문번호 1002에 해당하는 고객명과 상품명을 출력
df.loc[1002, ['고객명','상품명'] ]

고객명    이영희
상품명    모니터
Name: 1002, dtype: object

In [18]:
#문제8 
# 문제9
data = {
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3]
       }
df = pd.DataFrame(data)
print(df)

df = df.set_index('고객명')

# 인덱스 설정후
print("인덱스설정 후")
print(df)
# reset_index후
df = df.reset_index()
df

d

      고객명  상품명
주문번호
1001  김철수  키보드
1002  이영희  모니터
1003  박민수  마우스 !!!

      고객명  상품명
주문번호
1003  박민수  마우스
1001  김철수  키보드
1004  NaN  NaN
1002  이영희  모니터

In [20]:
# 문제9
data = {
    "고객명": ["김철수", "이영희", "박민수"],
    "상품명": ["키보드", "모니터", "마우스"],
    "수량": [2, 1, 3]
       }
df = pd.DataFrame(data)
print(df)

df = df.set_index('고객명')

# 인덱스 설정후
print("인덱스설정 후")
print(df)
# reset_index후
df = df.reset_index()
df

   고객명  상품명  수량
0  김철수  키보드   2
1  이영희  모니터   1
2  박민수  마우스   3
인덱스설정 후
     상품명  수량
고객명
김철수  키보드   2
이영희  모니터   1
박민수  마우스   3

   고객명  상품명  수량
0  김철수  키보드   2
1  이영희  모니터   1
2  박민수  마우스   3

In [24]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data,index=['r0','r2','r1',])
print(df)

ndf = df.sort_index(ascending=True) #True 오름차순
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r2   2   5   8  11  14
r1   3   6   9  12  15
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   3   6   9  12  15
r2   2   5   8  11  14

In [26]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data,index=['r0','r2','r1',])
print(df)

ndf = df.sort_index(ascending=False) #False 내림차순
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r2   2   5   8  11  14
r1   3   6   9  12  15
    c0  c1  c2  c3  c4
r2   2   5   8  11  14
r1   3   6   9  12  15
r0   1   4   7  10  13

In [53]:
dict_data = {'c0':[10,2,5], 'c1':[2,2,1], 'c2':[5,8,7], 'c3':[12,18,12], 'c4':[12,14,25]}
df = pd.DataFrame(dict_data,index=['r0','r2','r1',])

ndf = df.sort_values(by='c1', ascending=False)
print (ndf)
#C1 열을 기준으로 내림차순 정렬
ndf = df.sort_values(by=['c1','c3'], ascending=False)
print (ndf)
#C2 열을 기준으로 오름차순 정렬
ndf = df.sort_values(by=['c1','c3'], ascending=[False,True])
print (ndf)

    c0  c1  c2  c3  c4
r0  10   2   5  12  12
r2   2   2   8  18  14
r1   5   1   7  12  25
    c0  c1  c2  c3  c4
r2   2   2   8  18  14
r0  10   2   5  12  12
r1   5   1   7  12  25
    c0  c1  c2  c3  c4
r0  10   2   5  12  12
r2   2   2   8  18  14
r1   5   1   7  12  25

In [67]:
sr = pd.Series({'국어':100, '영어':90, '수학':100})
sr
sr[0:3] + 10

국어    110
영어    100
수학    110
dtype: int64

In [75]:
import pandas as pd

# 두 명의 성적 시리즈 생성
student1 = pd.Series({'국어':100, '영어':90, '수학':100})
student2 = pd.Series({'수학':100, '국어':90, '영어':100})  # ✅ student2로 제대로 정의

# 시리즈 더하기
sum_student = student1 + student2

# 결과 출력
print(sum_student)
print(type(sum_student))

국어    190
수학    200
영어    190
dtype: int64
<class 'pandas.core.series.Series'>

In [87]:
import pandas as pd

student1 = pd.Series({'국어': 100, '영어': 90, '수학': 100})
student2 = pd.Series({'수학': 100, '국어': 90, '영어': 100})

덧셈 = (student1 + student2).astype(int)
뺄셈 = (student1 + student2).astype(int)
곱셈 = (student1 + student2).astype(int)
나눗셈 = (student1 + student2).astype(i)

# 인덱스 이름을 합, 차, 곱, 나누기로 변경
df = pd.DataFrame([덧셈, 뺄셈, 곱셈, 나눗셈], index=['합', '차', '곱', '나누기'])
print(df)

        국어     수학     영어
합    190.0  200.0  190.0
차    190.0  200.0  190.0
곱    190.0  200.0  190.0
나누기  190.0  200.0  190.0

In [90]:
##다른분 출력시시

import pandas as pd
import math
student1 = pd.Series({
                        '국어':100,
                        '영어':80,
                        '수학':90,
})

student2 = pd.Series({
                        '수학':100,
                        '국어':80,
                        '영어':90,
})

덧셈 = student1 + student2
뺄셈 = student1 - student2
곱셈 = student1 * student2
나눗셈 = round(student1 / student2, 2)

df = pd.DataFrame([덧셈, 뺄셈, 곱셈, 나눗셈], index=['합', '차', '곱', '나누기']).T
df

        합     차       곱   나누기
국어  180.0  20.0  8000.0  1.25
수학  190.0 -10.0  9000.0  0.90
영어  170.0 -10.0  7200.0  0.89

In [92]:
##예제 1-23

import numpy as np
student1 = pd.Series({
                        '국어':np.nan,
                        '영어':80,
                        '수학':90,
})

student2 = pd.Series({
                        '수학':100,
                        '국어':80,
})

sr_add = student1.add(student2, fill_value=0) 
sr_sub = student1.sub(student2, fill_value=0) 
sr_mul = student1.mul(student2, fill_value=0) 
sr_div = student1.div(student2, fill_value=0) 

result = pd.DataFrame([덧셈, 뺄셈, 곱셈, 나눗셈], index=['덧셈', '뺄샘', '곱셈', '나눗셈'])
result

          국어      수학       영어
덧셈    180.00   190.0   170.00
뺄샘     20.00   -10.0   -10.00
곱셈   8000.00  9000.0  7200.00
나눗셈     1.25     0.9     0.89

In [29]:
#문제1) # 산술연산 문제1)
import pandas as pd
price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])
print(price)
discount_price = price * 0.9

print(discount_price)

키보드     30000
마우스     15000
모니터    200000
dtype: int64
키보드     27000.0
마우스     13500.0
모니터    180000.0
dtype: float64

In [31]:
#문제2)
import pandas as pd
price = pd.Series([5500, 15000, 12000], index=['햄버거', '피자', '파스타'])
print(price)
tax_price = price * 1.1

print(tax_price)

햄버거     5500
피자     15000
파스타    12000
dtype: int64
햄버거     6050.0
피자     16500.0
파스타    13200.0
dtype: float64

In [35]:
#문제3) 상품 가격 시리즈
import pandas as pd

price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])
# 구매 수량 시리즈
acount = pd.Series([2, 3, 1], index=['키보드', '마우스', '모니터'])
money = price * acount
money

키보드     60000
마우스     45000
모니터    200000
dtype: int64

In [37]:
# 문제4
mid_test = pd.Series([80, 85, 78], index=['철수', '영희', '민수'])
fin_test = pd.Series({"철수": 90, "영희": 95, "민수": 88})
avg_score = (mid_test + fin_test)/2
avg_score
df = pd.DataFrame( [mid_test, fin_test, avg_score] , index=['중간','기말','평균'])
student = df.T
student

      중간    기말    평균
철수  80.0  90.0  85.0
영희  85.0  95.0  90.0
민수  78.0  88.0  83.0

In [41]:
# 문제5
price = pd.Series([30000, 15000, 20000], index = ['키보드', '마우스', '모니터']) 
dis_rate = pd.Series([10, 5, 20], index = ['키보드', '마우스', '모니터'])
cal1 =  price.mul(dis_rate)
cal2 = cal1.div(100.0)
fin_price = price.sub(cal2)
print(fin_price)
df = pd.DataFrame( [price, fin_price], index=['원가가격', '최종가격'] )
data=df.T
data

키보드    27000.0
마우스    14250.0
모니터    16000.0
dtype: float64

        원가가격     최종가격
키보드  30000.0  27000.0
마우스  15000.0  14250.0
모니터  20000.0  16000.0

In [43]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [75]:
# 0~51행의 age, fare만 뽑아서 t_age_fare에 저장
t_age_fare = titanic.loc[0:51, ['age', 'fare']]

# 확인용 출력
print(t_age_fare)

# 곱셈
addition = t_age_fare * 10
print(addition)

titanic.tail()
titanic.loc[400:501, :]

     age      fare
0   22.0    7.2500
1   38.0   71.2833
2   26.0    7.9250
3   35.0   53.1000
4   35.0    8.0500
5    NaN    8.4583
6   54.0   51.8625
7    2.0   21.0750
8   27.0   11.1333
9   14.0   30.0708
10   4.0   16.7000
11  58.0   26.5500
12  20.0    8.0500
13  39.0   31.2750
14  14.0    7.8542
15  55.0   16.0000
16   2.0   29.1250
17   NaN   13.0000
18  31.0   18.0000
19   NaN    7.2250
20  35.0   26.0000
21  34.0   13.0000
22  15.0    8.0292
23  28.0   35.5000
24   8.0   21.0750
25  38.0   31.3875
26   NaN    7.2250
27  19.0  263.0000
28   NaN    7.8792
29   NaN    7.8958
30  40.0   27.7208
31   NaN  146.5208
32   NaN    7.7500
33  66.0   10.5000
34  28.0   82.1708
35  42.0   52.0000
36   NaN    7.2292
37  21.0    8.0500
38  18.0   18.0000
39  14.0   11.2417
40  40.0    9.4750
41  27.0   21.0000
42   NaN    7.8958
43   3.0   41.5792
44  19.0    7.8792
45   NaN    8.0500
46   NaN   15.5000
47   NaN    7.7500
48   NaN   21.6792
49  18.0   17.8000
50   7.0   39.6875
51  21.0    7.8000
      age      fare
0   220.0    72.500
1   380.0   712.833
2   260.0    79.250
3   350.0   531.000
4   350.0    80.500
5     NaN    84.583
6   540.0   518.625
7    20.0   210.750
8   270.0   111.333
9   140.0   300.708
10   40.0   167.000
11  580.0   265.500
12  200.0    80.500
13  390.0   312.750
14  140.0    78.542
15  550.0   160.000
16   20.0   291.250
17    NaN   130.000
18  310.0   180.000
19    NaN    72.250
20  350.0   260.000
21  340.0   130.000
22  150.0    80.292
23  280.0   355.000
24   80.0   210.750
25  380.0   313.875
26    NaN    72.250
27  190.0  2630.000
28    NaN    78.792
29    NaN    78.958
30  400.0   277.208
31    NaN  1465.208
32    NaN    77.500
33  660.0   105.000
34  280.0   821.708
35  420.0   520.000
36    NaN    72.292
37  210.0    80.500
38  180.0   180.000
39  140.0   112.417
40  400.0    94.750
41  270.0   210.000
42    NaN    78.958
43   30.0   415.792
44  190.0    78.792
45    NaN    80.500
46    NaN   155.000
47    NaN    77.500
48    NaN   216.792
49  180.0   178.000
50   70.0   396.875
51  210.0    78.000

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
400,1,3,male,39.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,yes,True
401,0,3,male,26.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
402,0,3,female,21.0,1,0,9.8250,S,Third,woman,False,NaN,Southampton,no,False
403,0,3,male,28.0,1,0,15.8500,S,Third,man,True,NaN,Southampton,no,False
404,0,3,female,20.0,0,0,8.6625,S,Third,woman,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
497,0,3,male,NaN,0,0,15.1000,S,Third,man,True,NaN,Southampton,no,True
498,0,1,female,25.0,1,2,151.5500,S,First,woman,False,C,Southampton,no,False
499,0,3,male,24.0,0,0,7.7958,S,Third,man,True,NaN,Southampton,no,True
500,0,3,male,17.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True

In [94]:
import numpy as np, pandas as pd

df1 = pd.DataFrame({"열A":[15,20,50,np.nan,np.nan],
                    "열B":[100,500,200,50,200],
                    "열C":[1,2,3,2,3]},
                   index=['행0','행1','행2','행3','행4'])

df2 = pd.DataFrame({"열A":[10,10,20,30,0],      
                    "열B":[200,100,200,100,100]},
                   index=['행0','행1','행2','행3','행4'])

df3 = df1.add(df2, fill_value=0)
df3

      열A   열B   열C
행0  25.0  300  1.0
행1  30.0  600  2.0
행2  70.0  400  3.0
행3  30.0  150  2.0
행4   0.0  300  3.0

In [110]:
import seaborn as sns

df3.loc['행1','열A'] != 30
titanic = sns.load_dataset('titanic')
titanic.head()
df = titanic.loc[0:9, ['age','fare']]
print(df['age'], df['age'] < 20)
df[df['age'] < 20]
df[df.age < 20]

#나이가 20대인 승객 출력 (age>=20)(age<=29)
df[df.age>=20) & df.age <=29)]

#나이가 20대 미만이고 여성 승객 출력 
titanic.head()
df_age_sex = titanic.loc[0:9, ['age','sex']]
df_age_sex [(df_age_sex.age <20) & df_age_sex.sex == 'female')]
#나이가  20세 미만이거나 여성인 승객
df_age_sex [(df_age_sex.age <20) & df_age_sex.sex == 'female')]
#조건은...
mask = (titanic.age < 10) | (titanic.age > 60)
titanic.loc[mask, ['age', 'sex', 'alone']]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64 0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
Name: age, dtype: bool

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [142]:
#문제6
import pandas as pd

# 상품 가격표 생성
df = pd.DataFrame({
    '상품명': ['키보드', '마우스', '모니터'],
    '2023년 가격(원)': [30000, 15000, 200000] })
print(df)

df['2024년도 가격(원)'] =df.loc[ : , "2023년 가격(원)"] * 1.05
df

   상품명  2023년 가격(원)
0  키보드        30000
1  마우스        15000
2  모니터       200000

   상품명  2023년 가격(원)  2024년도 가격(원)
0  키보드        30000       31500.0
1  마우스        15000       15750.0
2  모니터       200000      210000.0

In [173]:
#문제 7
import pandas as pd

# 1분기 매출
df = pd.DataFrame({
    '상품명': ['키보드', '마우스', '모니터'],
    '매출액(원)': [600000, 450000, 1200000]
})
print(df)
df = df.set_index("상품명")

# 2분기 매출
df2 = pd.DataFrame({
    '상품명': ['키보드', '마우스', '모니터'],
    '매출액(원)': [720000, 510000, 1500000]
})
print(df2)
df2 = df2.set_index("상품명")

# 분기별 매출 증가액 계산
print(df2 - df)
df3=df2 - df

   상품명   매출액(원)
0  키보드   600000
1  마우스   450000
2  모니터  1200000
   상품명   매출액(원)
0  키보드   720000
1  마우스   510000
2  모니터  1500000
     매출액(원)
상품명
키보드  120000
마우스   60000
모니터  300000

In [183]:
#문제 8
# 매출이 100만원 이상인 상품 찾기
import pandas as pd

df = pd.DataFrame({
    '상품명': ['키보드', '마우스', '모니터', '헤드셋', '웹캠'],
    '매출액': [300000, 500000, 1500000, 800000, 1200000]})
mask = df['매출액'] >= 1000000
mask
df [mask]

   상품명      매출액
2  모니터  1500000
4   웹캠  1200000

In [185]:
# 문제9
df = pd.DataFrame({'이름':['김철수', '이영희', '박민수', '정수현', '송지혜'], '나이':[25, 32, 40, 28, 35]})
df = df.set_index('이름')
mask = df.나이 >= 30
df.loc[mask, '나이']
df[mask]['나이']

이름
이영희    32
박민수    40
송지혜    35
Name: 나이, dtype: int64

In [233]:
import pandas as pd
import seaborn as sns

# Titanic 데이터 로드
titanic = sns.load_dataset('titanic')

# 1) 0~9행의 age, fare 추출 후 나이 20세 미만 필터
df = titanic.loc[0:9, ['age', 'fare']]
print(df.query('age < 20'))

# 2) 첫 5행 출력
print(titanic.head())

# 3) 1등급(pclass==1) 승객만
print(titanic.query('pclass == 1'))

# 4) 여성(woman) 이면서 deck이 'C'인 승객
print(titanic.query("(who == 'woman') & (deck == 'C')"))

# 5) 출력할 최대 컬럼 수 설정 및 초기화
pd.set_option('display.max_columns', 10)
print(pd.get_option('display.max_columns'))   # → 10
pd.reset_option('display.max_columns')
print(pd.get_option('display.max_columns'))   # 기본값 복원

# 6) Southampton 출발 승객 마스크
mask1 = titanic['embark_town'] == 'Southampton'
print(mask1)

# 7) Queenstown 출발 승객 마스크
mask2 = titanic['embark_town'] == 'Queenstown'
print(mask2)

# 8) 두 조건 합친 Boolean 인덱싱 결과
df_boolean = titanic[mask1 | mask2]
print(df_boolean)

# 9) .isin() 사용 예시
isin_filters = titanic['embark_town'].isin(['Southampton', 'Queenstown'])
print(titanic[isin_filters])

    age     fare
7   2.0  21.0750
9  14.0  30.0708
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1           1       1  female  38.0      1      0  71.2833        C  First
3           1       1  female  35.0      1      0  53.1000        S  First
6           0       1    male  54.0      0      0  51.8625        S  First
11          1       1  female  58.0      0      0  26.5500        S  First
23          1       1    male  28.0      0      0  35.5000        S  First
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
871         1       1  female  47.0      1      1  52.5542        S  First
872         0       1    male  33.0      0      0   5.0000        S  First
879         1       1  female  56.0      0      1  83.1583        C  First
887         1       1  female  19.0      0      0  30.0000        S  First
889         1       1    male  26.0      0      0  30.0000        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
11   woman       False    C  Southampton   yes   True
23     man        True    A  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
871  woman       False    D  Southampton   yes  False
872    man        True    B  Southampton    no   True
879  woman       False    C    Cherbourg   yes  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[216 rows x 15 columns]
     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
1           1       1  female  38.0      1      0   71.2833        C  First
3           1       1  female  35.0      1      0   53.1000        S  First
11          1       1  female  58.0      0      0   26.5500        S  First
88          1       1  female  23.0      3      2  263.0000        S  First
151         1       1  female  22.0      1      0   66.6000        S  First
177         0       1  female  50.0      0      0   28.7125        C  First
230         1       1  female  35.0      1      0   83.4750        S  First
268         1       1  female  58.0      0      1  153.4625        S  First
269         1       1  female  35.0      0      0  135.6333        S  First
307         1       1  female  17.0      1      0  108.9000        C  First
310         1       1  female  24.0      0      0   83.1583        C  First
318         1       1  female  31.0      0      2  164.8667        S  First
325         1       1  female  36.0      0      0  135.6333        C  First
341         1       1  female  24.0      3      2  263.0000        S  First
412         1       1  female  33.0      1      0   90.0000        Q  First
486         1       1  female  35.0      1      0   90.0000        S  First
498         0       1  female  25.0      1      2  151.5500        S  First
571         1       1  female  53.0      2      0   51.4792        S  First
581         1       1  female  39.0      1      1  110.8833        C  First
609         1       1  female  40.0      0      0  153.4625        S  First
669         1       1  female   NaN      1      0   52.0000        S  First
700         1       1  female  18.0      1      0  227.5250        C  First
710         1       1  female  24.0      0      0   49.5042        C  First
716         1       1  female  38.0      0      0  227.5250        C  First
849         1       1  female   NaN      1      0   89.1042        C  First
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
11   woman       False    C  Southampton   yes   True
88   woman       False    C  Southampton   yes  False
151  woman       False    C  Southampton   yes  False
177  woman       False    C    Cherbourg    no   True
230  woman       False    C  Southampton   yes  False
268  woman       False    C  Southampton   yes  False
269  woman       False    C  Southampton   yes   True
307  woman       False    C    Cherbourg   yes  False
310  woman       False    C    Cherbourg   yes   True
318  woman       False    C  Southampton   yes  False
325  woman       False    C    Cherbourg   yes   True
341  woman       False    C  Southampton   yes  False
412  woman       False    C   Queenstown   yes  False
486  woman       False    C  Southampton   yes  False
498  woman       False    C  Southampton    no  False
571  woman       False    C  Southampton   yes  False
581  woman       False    C    Cherbourg   yes  False
609  woman       False    C  Southampton   yes   True
669  woman       False    C  Southampton   yes  False
700  woman       False    C    Cherbourg   yes  False
710  woman       False    C    Cherbourg   yes   True
716  woman       False    C    Cherbourg   yes   True
849  woman       False    C    Cherbourg   yes  False
879  woman       False    C    Cherbourg   yes  False
10
20
0       True
1      False
2       True
3       True
4       True
       ...
886     True
887     True
888     True
889    False
890    False
Name: embark_town, Length: 891, dtype: bool
0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890     True
Name: embark_town, Length: 891, dtype: bool
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
5           0       3    male   NaN      0      0   8.4583        Q   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[721 rows x 15 columns]
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
5           0       3    male   NaN      0      0   8.4583        Q   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[721 rows x 15 columns]

In [235]:
# 문제9
df = pd.DataFrame({'이름':['김철수', '이영희', '박민수', '정수현', '송지혜'], '나이':[25, 32, 40, 28, 35]})
df = df.set_index('이름')
mask = df.나이 >= 30
df.loc[mask, '나이']
df[mask]['나이']

이름
이영희    32
박민수    40
송지혜    35
Name: 나이, dtype: int64

In [269]:
# 문제10
df = pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠'], 
                   '가격(원)':[30000, 500000, 1500000, 80000, 120000] } )
df=df.rename( columns = {'가격(원)': '가격'} )
# df = df.rename(columns={'A': 'Alpha', 'B': 'Beta'})
df.query( '가격 >= 30000 and 가격 <= 100000' )

   상품명     가격
0  키보드  30000
3  헤드셋  80000

In [273]:
# 문제11
df = pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠', '이어폰'], 
               '가격(원)':[300000,500000, 1500000, 80000, 120000, 25000] } )
mask = df['상품명'].isin(['키보드', '마우스', '웹캠' ] )
df[ mask ]

   상품명   가격(원)
0  키보드  300000
1  마우스  500000
4   웹캠  120000

In [281]:
import pandas as pd

# object dtype
df1 = pd.DataFrame({'이름': ['철수', '영희', None]}, dtype='object')
#, dtype = 'obhect' 생략할수 있다.
print(df1['이름'].dtype)  # object

df2 = pd.DataFrame({'이름': ['철수', '영희', None]}, dtype='string')
print(df2['이름'].dtype)
print(df2)

print(df1['이름'].isna())
print(df2['이름'].isna())

import numpy as np
np.nan

object
string
     이름
0    철수
1    영희
2  <NA>
0    False
1    False
2     True
Name: 이름, dtype: bool
0    False
1    False
2     True
Name: 이름, dtype: bool

nan

In [285]:
fruit_name = pd.Series(['Apple', 'Banana', 'cherry'])
print(fruit_name)

fruit_name = pd.Series(['Apple', 'Banana', 'cherry'], dtype='string')
fruit_name

fruit_name = pd.Series(['Apple', 'Banana', 'cherry'], dtype=pd.StringDtype())
fruit_name

fruit_name = pd.Series(['Apple', 'Banana', 'cherry'])
fruit_name = fruit_name.astype('string')
fruit_name

0     Apple
1    Banana
2    cherry
dtype: object

0     Apple
1    Banana
2    cherry
dtype: string

In [305]:
ser_obj = pd.Series({
    'first':  'Apple_사과',
    'Second': 'Banana_바나나',
    'Third':  'Cherry_체리',
    'Fourth': np.nan
})
ser_obj

ser_str = pd.Series({
    'first':  'Apple,사과,500',
    'Second': 'Banana,바나나,300',
    'Third':  'Cherry,체리,1000',
    'Fourth': np.nan
}, dtype='string')
ser_str

ser_obj.str.lower()
ser_str.str.lower()
ser_obj.str.upper()
ser_str.str.upper()

a = ser_str.str.split(',')
s1 = pd.Series({
    'c0': 'A:10,20,30',
    'c1': 'B:20,50,40'
})
a1 = s1.str.split(':')
aa1 = a1.str[1].str.split(',')
aa1

c0    [10, 20, 30]
c1    [20, 50, 40]
dtype: object

In [317]:
import pandas as pd
import numpy as np
# 교재 82page 코드 딕셔너리형태 시리즈 만들기
ser_obj = pd.Series({"First": 'Apple_사과_500',
                "Second": 'Banana_바나나_300',
                "Third": 'Cherry_체리_1000',
                "Fourth": np.nan})
ser_obj
ser_str = pd.Series({"First": 'Apple,사과,500',
                "Second": 'Banana,바나나,300',
                "Third": 'Cherry,체리,1000',
                "Fourth": np.nan}, dtype="string")
ser_str
# 소문자 변환
ser_obj.str.lower()
ser_str.str.lower()
ser_obj.str.upper()
ser_str.str.upper()
a = ser_str.str.split(',')
s1 = pd.Series({'c0': 'A:10-20-30',
                'c1': 'B:20-50-40'}, dtype="string")
#  [A, 10, 20, 30]  [B, 20, 50, 40]
a1 = s1.str.split(':')
print(a1)
aa1 = a1[0][1]
print(type(aa1), "@@@" )
a_10_20_30 = aa1.split('-')
print(a_10_20_30, "####")
a_answer =list(a1[0][0]) #['A'] + ['10','20','30']
a_answer = a_answer + a_10_20_30
a_answer

aa2 = a1[1][1]
print(type(aa2), "@@@" )
a_10_20_30 = aa2.split('-')
print(a_10_20_30, "####")
a_answer = list(a1[1][0]) #['A'] + ['10','20','30']
a_answer = a_answer + a_10_20_30
a_answer

s2 = pd.Series({'c0': 'A:10-20,20-30,40-50',
                'c1': 'B:20-50,10-40,60-20'}, dtype="string")

s2_a = s2.str.split(r'[:,-]')
s2_a

c0    [A, 10-20-30]
c1    [B, 20-50-40]
dtype: object
<class 'str'> @@@
['10', '20', '30'] ####
<class 'str'> @@@
['20', '50', '40'] ####

C:\Users\607\AppData\Local\Temp\ipykernel_12944\3104165433.py:25: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  aa1 = a1[0][1]
C:\Users\607\AppData\Local\Temp\ipykernel_12944\3104165433.py:29: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  a_answer =list(a1[0][0]) #['A'] + ['10','20','30']
C:\Users\607\AppData\Local\Temp\ipykernel_12944\3104165433.py:33: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  aa2 = a1[1][1]
C:\Users\607\AppData\Local\Temp\ipykernel_12944\3104165433.py:37: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  a_answer = list(a1[1][0]) #['A'] + ['10','20','30']

c0    [A, 10, 20, 20, 30, 40, 50]
c1    [B, 20, 50, 10, 40, 60, 20]
dtype: object

In [358]:
ser_obj = pd.Series({"First": 'Apple_사과_500',
                "Second": 'Banana_바나나_300',
                "Third": 'Cherry_체리_1000',
                "Fourth": np.nan})
ser_obj

ser_str = pd.Series({"First": 'Apple_ 사과 _500',
                "Second": 'Banana_ 바나나 _300',
                "Third": 'Cherry_ 체리_ 1000',
                "Fourth": np.nan}, dtype="string")
ser_str

s1 = ser_str.str.split('_', expand=True)
type(s1)
s2 = ser_str.str.split('_', expand=True)
type(s2)
s3 = ser_str.str.split('_')
type(s3)
s3
idx = s3.index
idx
vals = s3.values
vals

s4 = ser_str.str.split()
print(s4)

ser_str = pd.Series({'First':'  Apple_사과  _500   ',
                     'Second':'   Banana_바나나      _300   ',
                     'Third':'   Cherry_체리   _1000   ',
                     'Fourth':np.nan})

ser_str
# 기존 코드 유지, s3 할당만 수정
s3 = ser_str.str.split('_')
s3

s_r    = ser_str.str.replace("_", ":", regex=False)
print(s_r)

s_r_r  = ser_str.str.replace(r'[^A-Za-z0-9]', "", regex=True)
print(s_r_r)

print(ser_str)

print(ser_str.str[0:5])
print(ser_str.str.contains("0", na=False))

# contains_pattern 정의 후 출력
contains_pattern = ser_str.str.contains(r"[AB][a-z]+")
print(contains_pattern)
print("\n")

# 추가 조건도 바로 출력
print(ser_str.str.contains(r"[AB][a-z]+"))
print(ser_str.str.contains("Apple:사과"))
print("\n")

First       [Apple_, 사과, _500]
Second    [Banana_, 바나나, _300]
Third     [Cherry_, 체리_, 1000]
Fourth                    <NA>
dtype: object
First              Apple:사과  :500
Second       Banana:바나나      :300
Third           Cherry:체리   :1000
Fourth                           NaN
dtype: object
First       Apple500
Second     Banana300
Third     Cherry1000
Fourth           NaN
dtype: object
First              Apple_사과  _500
Second       Banana_바나나      _300
Third           Cherry_체리   _1000
Fourth                           NaN
dtype: object
First       App
Second       Ba
Third        Ch
Fourth      NaN
dtype: object
First      True
Second     True
Third      True
Fourth    False
dtype: bool
First      True
Second     True
Third     False
Fourth      NaN
dtype: object


First      True
Second     True
Third     False
Fourth      NaN
dtype: object
First     False
Second    False
Third     False
Fourth      NaN
dtype: object

In [22]:
import pandas as pd

# 예제 Series 정의
ser = pd.Series(['Apple_사과', 'Banana_바나나', 'Cherry_체리'])

# 1) 언더스코어("_")로 분할한 결과 출력 (리스트 형태)
print(ser.str.split("_"))

# 2) 언더스코어("_") 기준 분할 후 DataFrame으로 저장 및 출력
df = ser.str.split("_", expand=True)
print(df)

# 3) 분할된 결과에서 첫 번째 요소만 추출하여 출력
get_1 = ser.str.split("_").str.get(0)
print("\n")
print(get_1)

ser1 = pd.Series(['a-10-b', 'a1-20-b2'], index=['c0','c1'], dtype="string")
#print(ser1)

ser1_s = ser1.str.split("_").str.get(1)
print(ser1_s)
#"," ","문자열 기준으로 문리하기
ser1_2_s = ser1.str.split("[:\-]")
print(ser1_2_s)

0      [Apple, 사과]
1    [Banana, 바나나]
2     [Cherry, 체리]
dtype: object
        0    1
0   Apple   사과
1  Banana  바나나
2  Cherry   체리


0     Apple
1    Banana
2    Cherry
dtype: object
c0   NaN
c1   NaN
dtype: float64
c0      [a, 10, b]
c1    [a1, 20, b2]
dtype: object

In [28]:
idx = ser.index.astype(str)  # ← 문자열 형식으로 변환 (이건 인위적 추가가 아니라 필수 타입 캐스팅)
idx = pd.Series(idx)         # ← Series로 만들어야 str 접근자 사용 가능

print(idx)
print(idx.str.strip())
print(idx.str.lstrip())
print(idx.str.rstrip())

0    0
1    1
2    2
dtype: object
0    0
1    1
2    2
dtype: object
0    0
1    1
2    2
dtype: object
0    0
1    1
2    2
dtype: object

In [32]:
ser=ser.str.replace("_"), "-", regex=False)
ser

SyntaxError: unmatched ')' (3256278149.py, line 8)

In [34]:
import re
pattern = r"[A|C][a-z]"
test_string = [ "Apple", "Cat","hello", "Bat", "A" ]
for s in test_string:
    match = re.match( pattern, s )
    print(match)

ser.str.contains("A", na=False) #ser안에 "A"문자가 있는지 검색
ser.str.contains(r"[A|B][a-z]+") #r-정규표현식 regex,[A|B]

<re.Match object; span=(0, 2), match='Ap'>
<re.Match object; span=(0, 2), match='Ca'>
None
None
None

0     True
1     True
2    False
dtype: bool

In [56]:
import pandas as pd

# Series 정의
ser3 = pd.Series(["a1", "b2", "c3", "d4e5", "e6e7", "f8"], dtype="string")

# 숫자 추출 후 그룹화하여 문자열로 합치기
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
print(digits)

# 알파벳 추출 후 그룹화하여 문자열로 합치기
letters = ser3.str.extractall(r"([a-z])").groupby(level=0).agg(''.join)
print(letters)

# 대문자 포함 Series 예시
ser4 = pd.Series(["A1", "B2", "C3", "D4E5F9", "E6F7", "F8"], dtype="string")

# 한글 포함 Series 예시
ser5 = pd.Series(["가1", "나2", "다3", "라4마5바9", "바6사7", "사8"], dtype="string")

# 문자와 숫자 그룹 추출 (Pandas Named Group 사용)
split_columns = ser3.str.extractall(r"(?P<Letter>[a-z]+)(?P<digit>\d+)").groupby(level=0).agg(''.join)
print(split_columns)

    0
0   1
1   2
2   3
3  45
4  67
5   8
    0
0   a
1   b
2   c
3  de
4  ee
5   f
  Letter digit
0      a     1
1      b     2
2      c     3
3     de    45
4     ee    67
5      f     8

In [58]:
# 
ser3=pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8' ], dtype="string" )
# 숫자 추출하기
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
digits
# 영문자 소문자 추출하기
letters = ser3.str.extractall(r"([a-z])").groupby(level=0).agg(''.join)
letters
# 대문자 추출하기
ser4 = pd.Series(['A1', 'B2', 'C3', 'D4E5F9', 'E6F7', 'F8' ], dtype="string")
A_letters = ser4.str.extractall(r"([A-Z])").groupby(level=0).agg(''.join)
A_letters
# 한글 추출하기
ser5 = pd.Series(['가1', '나2', '다3', '라4마5바9', '바6사7', '사8' ], dtype="string")
h_letters = ser5.str.extractall(r"([가-힣])").groupby(level=0).agg(''.join)
h_letters
# 숫자와 문자를 따로 분리해서
split_columns = ser3.str.extract(r"(?P<문자>[a-z]+)(?P<숫자>\d+)")
# ?P<name> - 열의 이름을 할당하는 코드
print(split_columns)

split_columns = ser3.str.extractall(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)").groupby(level=0).agg("".join)
split_columns

  문자 숫자
0  a  1
1  b  2
2  c  3
3  d  4
4  e  6
5  f  8

  Letter Digit
0      a     1
1      b     2
2      c     3
3    def   459
4     ef    67
5      f     8

In [1]:
import pandas as pd
import json
import os

# 1) 예제 DataFrame 준비 (혹은 여러분 기존 변수 사용)
df = pd.DataFrame({
    "name": ["Jerry", "Riah", "Paul"],
    "algol": ["A", "A+", "B+"],
    "basic": ["C", "B", "C+"],
    "c++":   ["B+", "C", "A"]
})

# 2) JSON 파일로 쓰기
out_path = "sample.json"
df.to_json(
    out_path,
    orient="records",   # [{…},{…},…] 형태
    force_ascii=False,  # 한글·특수문자 그대로
    indent=2
)

# 3) 실제 생성 확인
print("파일 생성 확인:", os.path.isfile(out_path))
print("--- sample.json 내용 ---")
print(open(out_path, encoding="utf-8").read())

# 4) 다시 읽어서 DataFrame으로 복원
df2 = pd.read_json(out_path, orient="records")
print("\n# 복원된 DataFrame")
print(df2)

파일 생성 확인: True
--- sample.json 내용 ---
[
  {
    "name":"Jerry",
    "algol":"A",
    "basic":"C",
    "c++":"B+"
  },
  {
    "name":"Riah",
    "algol":"A+",
    "basic":"B",
    "c++":"C"
  },
  {
    "name":"Paul",
    "algol":"B+",
    "basic":"C+",
    "c++":"A"
  }
]

# 복원된 DataFrame
    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Paul    B+    C+   A

In [4]:
import json
import os

# 1) 저장할 데이터 예시
data = [
    {"name":"Jerry","algol":"A","basic":"C","c++":"B+"},
    {"name":"Riah","algol":"A+","basic":"B","c++":"C"},
    {"name":"Paul","algol":"B+","basic":"C+","c++":"A"}
]

# 2) 파일 쓰기
out_path = "sample.json"
with open(out_path, "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=2)

# 3) 생성 확인
print(f"파일 생성됨: {out_path} ->", os.path.isfile(out_path))
print("--- 파일 내용 ---")
print(open(out_path, encoding="utf-8").read())

파일 생성됨: sample.json -> True
--- 파일 내용 ---
[
  {
    "name": "Jerry",
    "algol": "A",
    "basic": "C",
    "c++": "B+"
  },
  {
    "name": "Riah",
    "algol": "A+",
    "basic": "B",
    "c++": "C"
  },
  {
    "name": "Paul",
    "algol": "B+",
    "basic": "C+",
    "c++": "A"
  }
]